Revit 2027 API
MEPAnalyticalSegment.GetPressureDropOverride Method
 Gets the overidden value of pressuer drop, in kg/(ft*s^2).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetPressureDropOverride()
Public Function GetPressureDropOverride As Double
public:
double GetPressureDropOverride()
member GetPressureDropOverride : unit -> float
Return Value
Double
 The overridden value, or 0.0 if the pressure drop is not overridden. Note that the value can be negative to indicate the pressure gain at the flow direction.
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace